HELYXcore-4.4.0/examples/legacy/multiphase/algebraicSlipFoam/bubbleColumn2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

// Umean = (alpha.air*rho.air*U.air + alpha.water*rho.water*U.water) / (alpha.air*rho.air + alpha.water*rho.water)
//       = (0.5*1*0.1 + 0.5*996*0) / (0.5*1 + 0.5*996) = 1.003e-04

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.1 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            slip;
    }
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
