HELYXcore-4.4.0/examples/legacy/multiphase/algebraicSlipFoam/bubbleColumn2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air water);

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-05;
    rho             [1 -3 0 0 0 0 0] 1;
}

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.7871e-06;
    rho             [1 -3 0 0 0 0 0] 996;
}

sigma     [1 0 -2 0 0 0 0] 0.07;

relativeVelocityModel algebraicSlipModel;

algebraicSlipModelCoeffs
{
    d               3e-03;
    Cd              0.44;
    residualAlpha   1e-06;
}

// ************************************************************************* //
