HELYXcore-4.4.0/examples/legacy/multiphase/algebraicSlipFoam/bubbleColumn2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     algebraicSlipFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         55;

deltaT          0.005;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;
maxAlphaCo      1;


functions
{
    fieldAverage1
    {
        type                fieldAverage;
        libs                ("libfieldFunctionObjects.so");

        writeControl        writeTime;

        fields
        (
            U
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
            Uair
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
            alpha.air
            {
                mean            on;
                prime2Mean      off;
                base            time;
            }
        );
    }
}

// ************************************************************************* //
